zsh-utilities-pkgtools.org
#+TITLE:  Zsh Utilities Pkgtools
#+AUTHOR: Xavier Garrido
#+DATE:   2013-02-08
#+OPTIONS: toc:nil num:nil ^:nil

This is part of the [[file:zsh-utilities.org][Zsh Utilities]].

* Zsh Utilities - Pkgtools
This file provides a set of =pkgtools= functions to ease definition and use of
zsh functions, to handle message log and to have some function facilities. Thus,
it is a quite central place since most of the function of [[file:zsh-utilities.org][Zsh Utilities]] relies
to this file. The original idea was by F. Mauger and can be found at [[https://nemo.lpc-caen.in2p3.fr/wiki/pkgtools][LPC Wiki website]].

** Default values
#+BEGIN_SRC sh
  function __pkgtools__default_values ()
  {
      __pkgtools__msg_use_color=1
      __pkgtools__msg_use_date=0
      __pkgtools__msg_split_lines=0
      __pkgtools__msg_quiet=0
      __pkgtools__msg_warning=1
      __pkgtools__msg_debug=0
      __pkgtools__msg_devel=0
      __pkgtools__msg_funcname=""
      __pkgtools__msg_funcname_deps=""
      __pkgtools__ui_interactive=1
      __pkgtools__ui_gui=0
      __pkgtools__os=$(uname -s)
      __pkgtools__arch=$(uname -m | sed 's/ //g')
      __pkgtools__answer_is_yes=false
      __pkgtools__stored_pwd=
      return 0
  }
  __pkgtools__default_values
#+END_SRC

** User Interface utilities
*** Setting batch or interactive session
#+BEGIN_SRC sh
  function pkgtools__ui_interactive ()
  {
      __pkgtools__ui_interactive=1
      return 0
  }

  function pkgtools__ui_batch ()
  {
      __pkgtools__ui_interactive=0
      return 0
  }

  function pkgtools__ui_is_interactive ()
  {
      if [ "x${PKGTOOLS_BATCH}" != "x" ]; then
          if  [ "x${PKGTOOLS_BATCH}" != "x0" ]; then
              return 1 # false;
          fi
      fi

      if [ ${__pkgtools__ui_interactive} = 1 ]; then
          return 0 # true
      fi
      return 1 # false
  }

  function pkgtools__ui_is_batch ()
  {
      pkgtools__ui_is_interactive
      if [ $? -eq 0 ]; then
          return 1
      fi
      return 0 # true
  }
#+END_SRC

*** Using GUI
#+BEGIN_SRC sh
  function pkgtools__ui_is_gui ()
  {
      if [ ${__pkgtools__ui_gui} = 1 ]; then
          return 0 # true
      fi
      return 1 # false
  }

  function pkgtools__ui_using_gui ()
  {
      __pkgtools__at_function_enter pkgtools__ui_using_gui
      pkgtools__ui_is_batch
      if [ $? -eq 0 ]; then
          pkgtools__msg_warning "Forcing interactive mode !"
          pkgtools__ui_interactive
      fi
      __pkgtools__ui_gui=1
      __pkgtools__at_function_exit
      return 0
  }

  function pkgtools__ui_not_using_gui ()
  {
      __pkgtools__ui_gui=0
      return 0
  }
#+END_SRC

** Function facilities
*** Setting function name
#+BEGIN_SRC sh
  function pkgtools__set_funcname ()
  {
      local fname=$1
      if [ "x${fname}" != "x" ]; then
          if [ "x${__pkgtools__msg_funcname_deps}" != "x" ]; then
              __pkgtools__msg_funcname_deps="${__pkgtools__msg_funcname_deps}@${fname}"
          else
              __pkgtools__msg_funcname_deps=${fname}
          fi
      fi
      __pkgtools__msg_funcname=${fname}
      return 0
  }

  function pkgtools__unset_funcname ()
  {
      local fname=$(echo ${__pkgtools__msg_funcname_deps} | tr "@" "\n" | tail -1)
      if [ "x${__pkgtools__msg_funcname_deps}" != "x" ]; then
          nfuncs=$(echo ${__pkgtools__msg_funcname_deps} | tr '@' '\n' | wc -l)
          let ncut=nfuncs-1
          tmp=$(echo -n ${__pkgtools__msg_funcname_deps} | tr "@" "\n" | head -${ncut} | tr '\n' '@' | sed 's/@$//g')
          if [ ${ncut} -eq 0 ]; then
              tmp=
          fi
          __pkgtools__msg_funcname_deps=${tmp}
      fi
      local previous_fname=$(echo ${__pkgtools__msg_funcname_deps} | tr "@" "\n" | tail -1)
      __pkgtools__msg_funcname=${previous_fname}
      return 0
  }
#+END_SRC

*** Registering functions
These functions must be used with interactive function for debug purpose as well
as getting well prefixed message using the function name.

#+BEGIN_SRC sh
  function __pkgtools__at_function_enter ()
  {
      pkgtools__set_funcname $1
      pkgtools__msg_devel "Entering..."
      return 0
  }

  function __pkgtools__at_function_exit ()
  {
      pkgtools__msg_devel "Exiting."
      pkgtools__unset_funcname
      return 0
  }
#+END_SRC

