zsh-utilities-pkgtools.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Zsh Utilities Pkgtools</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Xavier Garrido" />
<link rel="stylesheet" href="stylesheets/styles.css">
                <link rel="stylesheet" href="stylesheets/org-pygments.css">
</head>
<body>
<div id="content">
<h1 class="title">Zsh Utilities Pkgtools</h1>
<p>
This is part of the <a href="zsh-utilities.html">Zsh Utilities</a>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Zsh Utilities - Pkgtools</h2>
<div class="outline-text-2" id="text-1">
<p>
This file provides a set of <code>pkgtools</code> functions to ease definition and use of
zsh functions, to handle message log and to have some function facilities. Thus,
it is a quite central place since most of the function of <a href="zsh-utilities.html">Zsh Utilities</a> relies
to this file. The original idea was by F. Mauger and can be found at <a href="https://nemo.lpc-caen.in2p3.fr/wiki/pkgtools">LPC Wiki website</a>.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Default values</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">__pkgtools__default_values</span> ()
{
    <span class="org-variable-name">__pkgtools__msg_use_color</span>=1
    <span class="org-variable-name">__pkgtools__msg_use_date</span>=0
    <span class="org-variable-name">__pkgtools__msg_split_lines</span>=0
    <span class="org-variable-name">__pkgtools__msg_quiet</span>=0
    <span class="org-variable-name">__pkgtools__msg_verbose</span>=0
    <span class="org-variable-name">__pkgtools__msg_warning</span>=1
    <span class="org-variable-name">__pkgtools__msg_debug</span>=0
    <span class="org-variable-name">__pkgtools__msg_devel</span>=0
    <span class="org-variable-name">__pkgtools__msg_funcname</span>=<span class="org-string">""</span>
    <span class="org-variable-name">__pkgtools__msg_funcname_deps</span>=<span class="org-string">""</span>
    <span class="org-variable-name">__pkgtools__ui_interactive</span>=1
    <span class="org-variable-name">__pkgtools__ui_gui</span>=0
    <span class="org-variable-name">__pkgtools__os</span>=$(uname -s)
    <span class="org-variable-name">__pkgtools__arch</span>=$(uname -m | sed <span class="org-string">'s/ //g'</span>)
    <span class="org-keyword">return</span> 0
}
__pkgtools__default_values
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">User Interface utilities</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">Setting batch or interactive session</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__ui_interactive</span> ()
{
    <span class="org-variable-name">__pkgtools__ui_interactive</span>=1
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__ui_batch</span> ()
{
    <span class="org-variable-name">__pkgtools__ui_interactive</span>=0
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__ui_is_interactive</span> ()
{
    <span class="org-keyword">if</span> [ <span class="org-string">"x${PKGTOOLS_BATCH}"</span> != <span class="org-string">"x"</span> ]; <span class="org-keyword">then</span>
        <span class="org-keyword">if</span>  [ <span class="org-string">"x${PKGTOOLS_BATCH}"</span> != <span class="org-string">"x0"</span> ]; <span class="org-keyword">then</span>
            <span class="org-keyword">return</span> 1 <span class="org-comment-delimiter"># </span><span class="org-comment">false;</span>
        <span class="org-keyword">fi</span>
    <span class="org-keyword">fi</span>

    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__ui_interactive</span>} = 1 ]; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span> 0 <span class="org-comment-delimiter"># </span><span class="org-comment">true</span>
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 1 <span class="org-comment-delimiter"># </span><span class="org-comment">false</span>
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__ui_is_batch</span> ()
{
    pkgtools__ui_is_interactive
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">?</span> -eq 0 ]; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0 <span class="org-comment-delimiter"># </span><span class="org-comment">true</span>
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">Using GUI</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__ui_is_gui</span> ()
{
    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__ui_gui</span>} = 1 ]; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span> 0 <span class="org-comment-delimiter"># </span><span class="org-comment">true</span>
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 1 <span class="org-comment-delimiter"># </span><span class="org-comment">false</span>
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__ui_using_gui</span> ()
{
    __pkgtools__at_function_enter pkgtools__ui_using_gui
    pkgtools__ui_is_batch
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">?</span> -eq 0 ]; <span class="org-keyword">then</span>
        pkgtools__msg_warning <span class="org-string">"Forcing interactive mode !"</span>
        pkgtools__ui_interactive
    <span class="org-keyword">fi</span>
    <span class="org-variable-name">__pkgtools__ui_gui</span>=1
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__ui_not_using_gui</span> ()
{
    <span class="org-variable-name">__pkgtools__ui_gui</span>=0
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Function facilities</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1">Setting function name</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__set_funcname</span> ()
{
    <span class="org-builtin">local</span> <span class="org-variable-name">fname</span>=$<span class="org-variable-name">1</span>
    <span class="org-keyword">if</span> [ <span class="org-string">"x${fname}"</span> != <span class="org-string">"x"</span> ]; <span class="org-keyword">then</span>
        <span class="org-keyword">if</span> [ <span class="org-string">"x${__pkgtools__msg_funcname_deps}"</span> != <span class="org-string">"x"</span> ]; <span class="org-keyword">then</span>
            <span class="org-variable-name">__pkgtools__msg_funcname_deps</span>=<span class="org-string">"${__pkgtools__msg_funcname_deps}@${fname}"</span>
        <span class="org-keyword">else</span>
            <span class="org-variable-name">__pkgtools__msg_funcname_deps</span>=${<span class="org-variable-name">fname</span>}
        <span class="org-keyword">fi</span>
    <span class="org-keyword">fi</span>
    <span class="org-variable-name">__pkgtools__msg_funcname</span>=${<span class="org-variable-name">fname</span>}
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__unset_funcname</span> ()
{
    <span class="org-builtin">local</span> <span class="org-variable-name">fname</span>=$(<span class="org-builtin">echo</span> ${<span class="org-variable-name">__pkgtools__msg_funcname_deps</span>} | tr <span class="org-string">"@"</span> <span class="org-string">"\n"</span> | tail -1)
    <span class="org-keyword">if</span> [ <span class="org-string">"x${__pkgtools__msg_funcname_deps}"</span> != <span class="org-string">"x"</span> ]; <span class="org-keyword">then</span>
        <span class="org-variable-name">nfuncs</span>=$(<span class="org-builtin">echo</span> ${<span class="org-variable-name">__pkgtools__msg_funcname_deps</span>} | tr <span class="org-string">'@'</span> <span class="org-string">'\n'</span> | wc -l)
        <span class="org-builtin">let</span> <span class="org-variable-name">ncut</span>=nfuncs-1
        <span class="org-variable-name">tmp</span>=$(<span class="org-builtin">echo</span> -n ${<span class="org-variable-name">__pkgtools__msg_funcname_deps</span>} | tr <span class="org-string">"@"</span> <span class="org-string">"\n"</span> | head -${<span class="org-variable-name">ncut</span>} | tr <span class="org-string">'\n'</span> <span class="org-string">'@'</span> | sed <span class="org-string">'s/@$//g'</span>)
        <span class="org-keyword">if</span> [ ${<span class="org-variable-name">ncut</span>} -eq 0 ]; <span class="org-keyword">then</span>
            <span class="org-variable-name">tmp</span>=
        <span class="org-keyword">fi</span>
        <span class="org-variable-name">__pkgtools__msg_funcname_deps</span>=${<span class="org-variable-name">tmp</span>}
    <span class="org-keyword">fi</span>
    <span class="org-builtin">local</span> <span class="org-variable-name">previous_fname</span>=$(<span class="org-builtin">echo</span> ${<span class="org-variable-name">__pkgtools__msg_funcname_deps</span>} | tr <span class="org-string">"@"</span> <span class="org-string">"\n"</span> | tail -1)
    <span class="org-variable-name">__pkgtools__msg_funcname</span>=${<span class="org-variable-name">previous_fname</span>}
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2">Registering functions</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
These functions must be used with interactive function for debug purpose as well
as getting well prefixed message using the function name.
</p>

<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">__pkgtools__at_function_enter</span> ()
{
    pkgtools__set_funcname $<span class="org-variable-name">1</span>
    pkgtools__msg_devel <span class="org-string">"Entering..."</span>
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">__pkgtools__at_function_exit</span> ()
{
    pkgtools__msg_devel <span class="org-string">"Exiting."</span>
    pkgtools__unset_funcname
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
</div>
