zsh-utilities-pkgtools.org
** Colorized message utilities
The following functions provides some facilities to print colorized messages
given the importance level of such message. Given the number of functions, each
one is itemized to make navigation easier

*** Default color message
#+BEGIN_SRC sh
  function pkgtools__msg_color_normal ()
  {
      if [ ${__pkgtools__msg_use_color} = 1 ]; then
          echo -en "\\033[0;39m" 1>&2
      fi
      return 0
  }
#+END_SRC
*** Colorized message
**** Red message
#+BEGIN_SRC sh
  function pkgtools__msg_color_red ()
  {
      if [ ${__pkgtools__msg_use_color} = 1 ]; then
          echo -en "\\033[0;31m" 1>&2
      fi
      return 0
  }
  function pkgtools__msg_color_bright_red ()
  {
      if [ ${__pkgtools__msg_use_color} = 1 ]; then
          echo -en "\\033[0;31m" 1>&2
      fi
      return 0
  }
#+END_SRC
**** Green message
#+BEGIN_SRC sh
  function pkgtools__msg_color_green ()
  {
      if [ ${__pkgtools__msg_use_color} = 1 ]; then
          echo -en "\\033[0;32m" 1>&2
      fi
      return 0
  }
#+END_SRC
**** Brown message
#+BEGIN_SRC sh
  function pkgtools__msg_color_brown ()
  {
      if [ ${__pkgtools__msg_use_color} = 1 ]; then
          echo -en "\\033[0;33m" 1>&2
      fi
      return 0
  }
#+END_SRC
**** Blue message
#+BEGIN_SRC sh
  function pkgtools__msg_color_blue ()
  {
      if [ ${__pkgtools__msg_use_color} = 1 ]; then
          echo -en "\\033[0;34m" 1>&2
      fi
      return 0
  }
#+END_SRC
**** Violet message
#+BEGIN_SRC sh
  function pkgtools__msg_color_violet ()
  {
      if [ ${__pkgtools__msg_use_color} = 1 ]; then
          echo -en "\\033[0;35m" 1>&2
      fi
      return 0
  }
#+END_SRC
**** Grey message
#+BEGIN_SRC sh
  function pkgtools__msg_color_grey ()
  {
      if [ ${__pkgtools__msg_use_color} = 1 ]; then
          echo -en "\\033[0;37m" 1>&2
      fi
      return 0
  }
#+END_SRC
**** White message
#+BEGIN_SRC sh
  function pkgtools__msg_color_white ()
  {
      if [ ${__pkgtools__msg_use_color} = 1 ]; then
          echo -en "\\033[1;37m" 1>&2
      fi
      return 0
  }
#+END_SRC
**** Black message
#+BEGIN_SRC sh
  function pkgtools__msg_color_black ()
  {
      if [ ${__pkgtools__msg_use_color} = 1 ]; then
          echo -en "\\033[1;39m" 1>&2
      fi
      return 0
  }
#+END_SRC
*** Reverse color
#+BEGIN_SRC sh
  function pkgtools__msg_color_reverse ()
  {
      if [ ${__pkgtools__msg_use_color} = 1 ]; then
          echo -en "\\033[1;7m" 1>&2
      fi
      return 0
  }

  function pkgtools__msg_color_no_reverse ()
  {
      if [ ${__pkgtools__msg_use_color} = 1 ]; then
          echo -en "\\033[1;27m" 1>&2
      fi
      return 0
  }
#+END_SRC
*** Cancel color
#+BEGIN_SRC sh
  function pkgtools__msg_color__cancel ()
  {
      if [ ${__pkgtools__msg_use_color} = 1 ]; then
          echo -en "\\033[1;m" 1>&2
      fi
      return 0
  }
#+END_SRC
*** Underline message
#+BEGIN_SRC sh
  function pkgtools__msg_color_underline ()
  {
      if [ ${__pkgtools__msg_use_color} = 1 ]; then
          echo -en "\\033[0;38m" 1>&2
      fi
      return 0
  }
#+END_SRC
*** Bold message
#+BEGIN_SRC sh
  function pkgtools__msg_color_bold ()
  {
      if [ ${__pkgtools__msg_use_color} = 1 ]; then
          echo -en "\\033[1;1m" 1>&2
      fi
      return 0
  }
#+END_SRC
*** Blinking message
#+BEGIN_SRC sh
  function pkgtools__msg_color_blink ()
  {
      if [ ${__pkgtools__msg_use_color} = 1 ]; then
          echo -en "" 1>&2
      fi
      return 0
  }

  function pkgtools__msg_color_no_blink ()
  {
      if [ ${__pkgtools__msg_use_color} = 1 ]; then
          echo -en "" 1>&2
      fi
      return 0
  }
#+END_SRC
*** Hightlight message
#+BEGIN_SRC sh
  function pkgtools__highlight ()
  {
      pkgtools__msg_color_bright_red
      echo -en "$@" 1>&2
      pkgtools__msg_color_normal
      return 0
  }
#+END_SRC

** Message log utilities
Use to print message requiring different level of attention.

