zsh-utilities-pkgtools.html
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Colorized message utilities</h3>
<div class="outline-text-3" id="text-1-4">
<p>
The following functions provides some facilities to print colorized messages
given the importance level of such message. Given the number of functions, each
one is itemized to make navigation easier
</p>
</div>

<div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1">Default color message</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_color_normal</span> ()
{
    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_use_color</span>} = 1 ]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> -en <span class="org-string">"\\033[0;39m"</span> 1&gt;&amp;2
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2">Colorized message</h4>
<div class="outline-text-4" id="text-1-4-2">
</div><ul class="org-ul"><li>Red message<br  /><div class="outline-text-5" id="text-1-4-2-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_color_red</span> ()
{
    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_use_color</span>} = 1 ]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> -en <span class="org-string">"\\033[0;31m"</span> 1&gt;&amp;2
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}
<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_color_bright_red</span> ()
{
    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_use_color</span>} = 1 ]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> -en <span class="org-string">"\\033[0;31m"</span> 1&gt;&amp;2
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</li>

<li>Green message<br  /><div class="outline-text-5" id="text-1-4-2-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_color_green</span> ()
{
    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_use_color</span>} = 1 ]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> -en <span class="org-string">"\\033[0;32m"</span> 1&gt;&amp;2
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</li>

<li>Brown message<br  /><div class="outline-text-5" id="text-1-4-2-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_color_brown</span> ()
{
    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_use_color</span>} = 1 ]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> -en <span class="org-string">"\\033[0;33m"</span> 1&gt;&amp;2
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</li>

<li>Blue message<br  /><div class="outline-text-5" id="text-1-4-2-4">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_color_blue</span> ()
{
    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_use_color</span>} = 1 ]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> -en <span class="org-string">"\\033[0;34m"</span> 1&gt;&amp;2
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</li>

<li>Violet message<br  /><div class="outline-text-5" id="text-1-4-2-5">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_color_violet</span> ()
{
    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_use_color</span>} = 1 ]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> -en <span class="org-string">"\\033[0;35m"</span> 1&gt;&amp;2
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</li>

<li>Grey message<br  /><div class="outline-text-5" id="text-1-4-2-6">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_color_grey</span> ()
{
    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_use_color</span>} = 1 ]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> -en <span class="org-string">"\\033[0;37m"</span> 1&gt;&amp;2
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</li>

<li>White message<br  /><div class="outline-text-5" id="text-1-4-2-7">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_color_white</span> ()
{
    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_use_color</span>} = 1 ]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> -en <span class="org-string">"\\033[1;37m"</span> 1&gt;&amp;2
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</li>

<li>Black message<br  /><div class="outline-text-5" id="text-1-4-2-8">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_color_black</span> ()
{
    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_use_color</span>} = 1 ]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> -en <span class="org-string">"\\033[1;39m"</span> 1&gt;&amp;2
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</li></ul>
</div>

<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3">Reverse color</h4>
<div class="outline-text-4" id="text-1-4-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_color_reverse</span> ()
{
    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_use_color</span>} = 1 ]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> -en <span class="org-string">"\\033[1;7m"</span> 1&gt;&amp;2
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_color_no_reverse</span> ()
{
    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_use_color</span>} = 1 ]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> -en <span class="org-string">"\\033[1;27m"</span> 1&gt;&amp;2
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-4" class="outline-4">
<h4 id="sec-1-4-4">Cancel color</h4>
<div class="outline-text-4" id="text-1-4-4">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_color__cancel</span> ()
{
    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_use_color</span>} = 1 ]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> -en <span class="org-string">"\\033[1;m"</span> 1&gt;&amp;2
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-5" class="outline-4">
<h4 id="sec-1-4-5">Underline message</h4>
<div class="outline-text-4" id="text-1-4-5">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_color_underline</span> ()
{
    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_use_color</span>} = 1 ]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> -en <span class="org-string">"\\033[0;38m"</span> 1&gt;&amp;2
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-6" class="outline-4">
<h4 id="sec-1-4-6">Bold message</h4>
<div class="outline-text-4" id="text-1-4-6">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_color_bold</span> ()
{
    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_use_color</span>} = 1 ]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> -en <span class="org-string">"\\033[1;1m"</span> 1&gt;&amp;2
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-7" class="outline-4">
<h4 id="sec-1-4-7">Blinking message</h4>
<div class="outline-text-4" id="text-1-4-7">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_color_blink</span> ()
{
    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_use_color</span>} = 1 ]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> -en <span class="org-string">""</span> 1&gt;&amp;2
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_color_no_blink</span> ()
{
    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_use_color</span>} = 1 ]; <span class="org-keyword">then</span>
        <span class="org-builtin">echo</span> -en <span class="org-string">""</span> 1&gt;&amp;2
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-8" class="outline-4">
<h4 id="sec-1-4-8">Hightlight message</h4>
<div class="outline-text-4" id="text-1-4-8">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__highlight</span> ()
{
    pkgtools__msg_color_bright_red
    <span class="org-builtin">echo</span> -en <span class="org-string">"$@"</span> 1&gt;&amp;2
    pkgtools__msg_color_normal
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Message log utilities</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Use to print message requiring different level of attention.
</p>
</div>
