zsh-utilities-pkgtools.org
*** Notice message
#+BEGIN_SRC sh
  function pkgtools__msg_notice ()
  {
      # pkgtools__msg_is_quiet
      # if [ $? -eq 0 ]; then
      #     return 0
      # fi

      pkgtools__msg_color_blue
      __pkgtools__base_msg_prefix "NOTICE"
      __pkgtools__base_msg "$@"
      pkgtools__msg_color_normal

      pkgtools__ui_is_interactive
      if [ $? -ne 0 ]; then
          return 0
      fi
      pkgtools__ui_is_gui
      if [ $? -eq 0 ]; then
          message="$@"
          term_nl=$(stty size | cut -d' ' -f1)
          term_nc=$(stty size | cut -d' ' -f2)
          let max_nlines=term_nl-3
          let max_ncols=term_nc-4
          nl=$(echo -e "${message}" | wc -l)
          let nlines=nl+4
          if [ ${nlines} -gt ${max_nlines} ]; then
              nlines=${max_nlines}
          fi
          if [ ${nlines} -lt 6 ]; then
              nlines=6
          fi
          ${__pkgtools__ui_dialog_bin} --title "pkgtools GUI" \
                                       --colors --msgbox "\Z4NOTICE:\n\Zn ${message}" ${nlines} ${max_ncols}
          return 0
      fi
      return 0
  }

  function pkgtools__msg_highlight_notice ()
  {
      pkgtools__msg_color_green
      __pkgtools__base_msg_prefix "NOTICE"
      __pkgtools__base_msg $@
      pkgtools__msg_color_normal

      pkgtools__ui_is_interactive
      if [ $? -ne 0 ]; then
          return 0
      fi
      pkgtools__ui_is_gui
      if [ $? -eq 0 ]; then
          message="$@"
          ${__pkgtools__ui_dialog_bin} --title "pkgtools GUI" \
                                       --colors --msgbox "\Z4\ZbNOTICE:\n\Zn ${message}" 10 40
          return 0
      fi
      return 0
  }
#+END_SRC
*** Info message
#+BEGIN_SRC sh
  function pkgtools__msg_info ()
  {
      pkgtools__msg_is_quiet
      if [ $? -eq 0 ]; then
          return 0
      fi

      pkgtools__msg_color_blue
      __pkgtools__base_msg_prefix "INFO"
      __pkgtools__base_msg  $@
      pkgtools__msg_color_normal

      pkgtools__ui_is_interactive
      if [ $? -ne 0 ]; then
          return 0
      fi
      pkgtools__ui_is_gui
      if [ $? -eq 0 ]; then
          message="$@"
          ${__pkgtools__ui_dialog_bin} --title "pkgtools GUI" \
                                       --colors --msgbox "\Z4\ZbINFO:\n\Zn ${message}" 10 40
          return 0
      fi
      return 0
  }
#+END_SRC
*** Verbose message
#+BEGIN_SRC sh
  function pkgtools__msg_using_verbose ()
  {
      __pkgtools__msg_quiet=0
      return 0
  }

  function pkgtools__msg_not_using_verbose ()
  {
      __pkgtools__msg_quiet=1
      return 0
  }

  function pkgtools__msg_verbose ()
  {
      pkgtools__msg_info $@
      return 0
  }
#+END_SRC
*** Debug message
#+BEGIN_SRC sh
  function pkgtools__msg_using_debug ()
  {
      __pkgtools__msg_debug=1
      return 0
  }

  function pkgtools__msg_not_using_debug ()
  {
      __pkgtools__msg_debug=0
      return 0
  }

  function pkgtools__msg_debug ()
  {
      if [ ${__pkgtools__msg_debug} -eq 0 ]; then
          return 0
      fi
      ok=1
      if [ ${ok} -eq 1 ]; then
          pkgtools__msg_color_brown
          __pkgtools__base_msg_prefix "DEBUG"
          __pkgtools__base_msg  $@
          pkgtools__msg_color_normal
      fi
      return 0
  }
#+END_SRC
*** Warning message
#+BEGIN_SRC sh
  function pkgtools__msg_using_warning ()
  {
      __pkgtools__msg_warning=1
      return 0
  }

  function pkgtools__msg_not_using_warning ()
  {
      __pkgtools__msg_warning=0
      return 0
  }

  function pkgtools__msg_warning ()
  {
      if [ ${__pkgtools__msg_warning} -eq 0 ]; then
          return 0
      fi
      pkgtools__msg_color_violet
      __pkgtools__base_msg_prefix "WARNING"
      __pkgtools__base_msg  $@
      pkgtools__msg_color_normal

      pkgtools__ui_is_interactive
      if [ $? -ne 0 ]; then
          return 0
      fi
      pkgtools__ui_is_gui
      if [ $? -eq 0 ]; then
          message="$@"
          ${__pkgtools__ui_dialog_bin} --title "pkgtools GUI" \
                                       --colors --msgbox "\Z5WARNING:\n\Zn ${message}" 10 40
          return 0
      fi
      return 0
  }
#+END_SRC
