zsh-utilities-pkgtools.html

<div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1">Notice message</h4>
<div class="outline-text-4" id="text-1-5-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_notice</span> ()
{
    pkgtools__msg_is_quiet
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">?</span> -eq 0 ]; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span> 0
    <span class="org-keyword">fi</span>

    pkgtools__msg_color_blue
    __pkgtools__base_msg_prefix <span class="org-string">"NOTICE"</span>
    __pkgtools__base_msg <span class="org-string">"$@"</span>
    pkgtools__msg_color_normal

    pkgtools__ui_is_interactive
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">?</span> -ne 0 ]; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span> 0
    <span class="org-keyword">fi</span>
    pkgtools__ui_is_gui
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">?</span> -eq 0 ]; <span class="org-keyword">then</span>
        <span class="org-variable-name">message</span>=<span class="org-string">"$@"</span>
        <span class="org-variable-name">term_nl</span>=$(stty size | cut -d<span class="org-string">' '</span> -f1)
        <span class="org-variable-name">term_nc</span>=$(stty size | cut -d<span class="org-string">' '</span> -f2)
        <span class="org-builtin">let</span> <span class="org-variable-name">max_nlines</span>=term_nl-3
        <span class="org-builtin">let</span> <span class="org-variable-name">max_ncols</span>=term_nc-4
        <span class="org-variable-name">nl</span>=$(<span class="org-builtin">echo</span> -e <span class="org-string">"${message}"</span> | wc -l)
        <span class="org-builtin">let</span> <span class="org-variable-name">nlines</span>=nl+4
        <span class="org-keyword">if</span> [ ${<span class="org-variable-name">nlines</span>} -gt ${<span class="org-variable-name">max_nlines</span>} ]; <span class="org-keyword">then</span>
            <span class="org-variable-name">nlines</span>=${<span class="org-variable-name">max_nlines</span>}
        <span class="org-keyword">fi</span>
        <span class="org-keyword">if</span> [ ${<span class="org-variable-name">nlines</span>} -lt 6 ]; <span class="org-keyword">then</span>
            <span class="org-variable-name">nlines</span>=6
        <span class="org-keyword">fi</span>
        ${<span class="org-variable-name">__pkgtools__ui_dialog_bin</span>} --title <span class="org-string">"pkgtools GUI"</span> <span class="org-sh-escaped-newline">\</span>
            --colors --msgbox <span class="org-string">"\Z4NOTICE:\n\Zn ${message}"</span> ${<span class="org-variable-name">nlines</span>} ${<span class="org-variable-name">max_ncols</span>}
        <span class="org-keyword">return</span> 0
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_highlight_notice</span> ()
{
    pkgtools__msg_color_green
    __pkgtools__base_msg_prefix <span class="org-string">"NOTICE"</span>
    __pkgtools__base_msg $<span class="org-variable-name">@</span>
    pkgtools__msg_color_normal

    pkgtools__ui_is_interactive
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">?</span> -ne 0 ]; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span> 0
    <span class="org-keyword">fi</span>
    pkgtools__ui_is_gui
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">?</span> -eq 0 ]; <span class="org-keyword">then</span>
        <span class="org-variable-name">message</span>=<span class="org-string">"$@"</span>
        ${<span class="org-variable-name">__pkgtools__ui_dialog_bin</span>} --title <span class="org-string">"pkgtools GUI"</span> <span class="org-sh-escaped-newline">\</span>
            --colors --msgbox <span class="org-string">"\Z4\ZbNOTICE:\n\Zn ${message}"</span> 10 40
        <span class="org-keyword">return</span> 0
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5-2" class="outline-4">
<h4 id="sec-1-5-2">Info message</h4>
<div class="outline-text-4" id="text-1-5-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_info</span> ()
{
    pkgtools__msg_is_quiet
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">?</span> -eq 0 ]; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span> 0
    <span class="org-keyword">fi</span>

    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_verbose</span>} -eq 0 ]; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span> 0
    <span class="org-keyword">fi</span>

    pkgtools__msg_color_blue
    __pkgtools__base_msg_prefix <span class="org-string">"INFO"</span>
    __pkgtools__base_msg  $<span class="org-variable-name">@</span>
    pkgtools__msg_color_normal

    pkgtools__ui_is_interactive
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">?</span> -ne 0 ]; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span> 0
    <span class="org-keyword">fi</span>
    pkgtools__ui_is_gui
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">?</span> -eq 0 ]; <span class="org-keyword">then</span>
        <span class="org-variable-name">message</span>=<span class="org-string">"$@"</span>
        ${<span class="org-variable-name">__pkgtools__ui_dialog_bin</span>} --title <span class="org-string">"pkgtools GUI"</span> <span class="org-sh-escaped-newline">\</span>
            --colors --msgbox <span class="org-string">"\Z4\ZbINFO:\n\Zn ${message}"</span> 10 40
        <span class="org-keyword">return</span> 0
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5-3" class="outline-4">
<h4 id="sec-1-5-3">Verbose message</h4>
<div class="outline-text-4" id="text-1-5-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_using_verbose</span> ()
{
    <span class="org-variable-name">__pkgtools__msg_verbose</span>=1
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_not_using_verbose</span> ()
{
    <span class="org-variable-name">__pkgtools__msg_verbose</span>=0
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_verbose</span> ()
{
    pkgtools__msg_info $<span class="org-variable-name">@</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5-4" class="outline-4">
<h4 id="sec-1-5-4">Debug message</h4>
<div class="outline-text-4" id="text-1-5-4">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_using_debug</span> ()
{
    <span class="org-variable-name">__pkgtools__msg_debug</span>=1
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_not_using_debug</span> ()
{
    <span class="org-variable-name">__pkgtools__msg_debug</span>=0
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_debug</span> ()
{
    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_debug</span>} -eq 0 ]; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span> 0
    <span class="org-keyword">fi</span>
    <span class="org-variable-name">ok</span>=1
    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">ok</span>} -eq 1 ]; <span class="org-keyword">then</span>
        pkgtools__msg_color_brown
        __pkgtools__base_msg_prefix <span class="org-string">"DEBUG"</span>
        __pkgtools__base_msg  $<span class="org-variable-name">@</span>
        pkgtools__msg_color_normal
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5-5" class="outline-4">
<h4 id="sec-1-5-5">Warning message</h4>
<div class="outline-text-4" id="text-1-5-5">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_using_warning</span> ()
{
    <span class="org-variable-name">__pkgtools__msg_warning</span>=1
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_not_using_warning</span> ()
{
    <span class="org-variable-name">__pkgtools__msg_warning</span>=0
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_warning</span> ()
{
    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_warning</span>} -eq 0 ]; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span> 0
    <span class="org-keyword">fi</span>
    pkgtools__msg_color_violet
    __pkgtools__base_msg_prefix <span class="org-string">"WARNING"</span>
    __pkgtools__base_msg  $<span class="org-variable-name">@</span>
    pkgtools__msg_color_normal

    pkgtools__ui_is_interactive
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">?</span> -ne 0 ]; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span> 0
    <span class="org-keyword">fi</span>
    pkgtools__ui_is_gui
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">?</span> -eq 0 ]; <span class="org-keyword">then</span>
        <span class="org-variable-name">message</span>=<span class="org-string">"$@"</span>
        ${<span class="org-variable-name">__pkgtools__ui_dialog_bin</span>} --title <span class="org-string">"pkgtools GUI"</span> <span class="org-sh-escaped-newline">\</span>
            --colors --msgbox <span class="org-string">"\Z5WARNING:\n\Zn ${message}"</span> 10 40
        <span class="org-keyword">return</span> 0
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
