zsh-utilities-pkgtools.org
*** Error message
#+BEGIN_SRC sh
  function pkgtools__msg_err ()
  {
      pkgtools__msg_color_red
      __pkgtools__base_msg_prefix "ERROR"
      __pkgtools__base_msg $@
      pkgtools__msg_color_normal

      pkgtools__ui_is_interactive
      if [ $? -ne 0 ]; then
          return 0
      fi
      pkgtools__ui_is_gui
      if [ $? -eq 0 ]; then
          message="$@"
          ${__pkgtools__ui_dialog_bin} --title "pkgtools GUI" \
                                       --colors --msgbox "\Z1ERROR:\n\Zn ${message}" 10 40
          return 0
      fi
      return 0
  }

  function pkgtools__msg_error ()
  {
      pkgtools__msg_err $@
      return 0
  }
#+END_SRC
*** Devel message
#+BEGIN_SRC sh
  function pkgtools__msg_using_devel ()
  {
      __pkgtools__msg_devel=1
      return 0
  }

  function pkgtools__msg_not_using_devel ()
  {
      __pkgtools__msg_devel=0
      return 0
  }

  function pkgtools__msg_devel ()
  {
      if [ ${__pkgtools__msg_devel} -eq 0 ]; then
          return 0
      fi
      ok=1
      if [ ${ok} -eq 1 ]; then
          pkgtools__msg_color_reverse
          __pkgtools__base_msg_prefix "DEVEL"
          __pkgtools__base_msg $@
          pkgtools__msg_color_no_reverse
      fi
      pkgtools__msg_color_normal
      return 0
  }
#+END_SRC
*** Be quiet
#+BEGIN_SRC sh
  function pkgtools__msg_using_quiet ()
  {
      __pkgtools__msg_quiet=1
      return 0
  }

  function pkgtools__msg_not_using_quiet ()
  {
      __pkgtools__msg_quiet=0
      return 0
  }

  function pkgtools__msg_is_quiet ()
  {
      if [ "x${PKGTOOLS_MSG_QUIET}" != "x" ]; then
          if [ "x${PKGTOOLS_MSG_QUIET}" != "x0" ]; then
              return 0 # false
          fi
      else
          if [ ${__pkgtools__msg_quiet} -eq 1  ]; then
              return 0 # true
          fi
      fi
      return 1
  }
#+END_SRC
*** Print date
#+BEGIN_SRC sh
  function pkgtools__msg_using_date ()
  {
      __pkgtools__msg_use_date=1
      return 0
  }

  function pkgtools__msg_not_using_date ()
  {
      __pkgtools__msg_use_date=0
      return 0
  }
#+END_SRC
*** Make use of color
#+BEGIN_SRC sh
  function pkgtools__msg_using_color ()
  {
      __pkgtools__msg_use_color=1
      return 0
  }

  function pkgtools__msg_not_using_color ()
  {
      __pkgtools__msg_use_color=0
      pkgtools__msg_color_normal
      return 0
  }
#+END_SRC
*** Misc.
#+BEGIN_SRC sh
  function __pkgtools__base_msg_prefix ()
  {
      local log_file=
      if [ "x${PKGTOOLS_LOG_FILE}" != "x" ]; then
          log_file=${PKGTOOLS_LOG_FILE}
      else
          log_file=/dev/null
      fi
      local msg_prefix="$1"
      (
          (
              echo -n "${msg_prefix}: "
          ) | tee -a ${log_file}
      ) 1>&2
      return 0
  }

  function __pkgtools__base_msg ()
  {
      local log_file=
      if [ "x${PKGTOOLS_LOG_FILE}" != "x" ]; then
          log_file=${PKGTOOLS_LOG_FILE}
      else
          log_file=/dev/null
      fi
      (
          (
              if [ ${__pkgtools__msg_use_date} -eq 1 ]; then
                  date +%F-%T | tr -d '\n'
                  echo -n " @ "
              fi
              if [ "x${appname}" != "x" ]; then
                  echo -n "${appname}: "
              fi
              if [ "x${__pkgtools__msg_funcname}" != "x" ]; then
                  echo -n "${__pkgtools__msg_funcname}: "
              fi
              if [ ${__pkgtools__msg_split_lines} -eq 1 ]; then
                  echo ""
                  echo -n "  "
              fi
              echo "$@"
          ) | tee -a ${log_file}
      ) 1>&2
      return 0;
  }
#+END_SRC

** Shell utilities
*** Check if a environment variable is set
#+BEGIN_SRC sh
  function pkgtools__check_variable ()
  {
      if env | grep -q "^$1="; then
          return 0
      else
          return 1
      fi
  }
#+END_SRC
