zsh-utilities-pkgtools.html

<div id="outline-container-sec-1-5-6" class="outline-4">
<h4 id="sec-1-5-6">Error message</h4>
<div class="outline-text-4" id="text-1-5-6">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_err</span> ()
{
    pkgtools__msg_color_red
    __pkgtools__base_msg_prefix <span class="org-string">"ERROR"</span>
    __pkgtools__base_msg $<span class="org-variable-name">@</span>
    pkgtools__msg_color_normal

    pkgtools__ui_is_interactive
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">?</span> -ne 0 ]; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span> 0
    <span class="org-keyword">fi</span>
    pkgtools__ui_is_gui
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">?</span> -eq 0 ]; <span class="org-keyword">then</span>
        <span class="org-variable-name">message</span>=<span class="org-string">"$@"</span>
        ${<span class="org-variable-name">__pkgtools__ui_dialog_bin</span>} --title <span class="org-string">"pkgtools GUI"</span> <span class="org-sh-escaped-newline">\</span>
            --colors --msgbox <span class="org-string">"\Z1ERROR:\n\Zn ${message}"</span> 10 40
        <span class="org-keyword">return</span> 0
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_error</span> ()
{
    pkgtools__msg_err $<span class="org-variable-name">@</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5-7" class="outline-4">
<h4 id="sec-1-5-7">Devel message</h4>
<div class="outline-text-4" id="text-1-5-7">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_using_devel</span> ()
{
    <span class="org-variable-name">__pkgtools__msg_devel</span>=1
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_not_using_devel</span> ()
{
    <span class="org-variable-name">__pkgtools__msg_devel</span>=0
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_devel</span> ()
{
    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_devel</span>} -eq 0 ]; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span> 0
    <span class="org-keyword">fi</span>
    <span class="org-variable-name">ok</span>=1
    <span class="org-keyword">if</span> [ ${<span class="org-variable-name">ok</span>} -eq 1 ]; <span class="org-keyword">then</span>
        pkgtools__msg_color_reverse
        __pkgtools__base_msg_prefix <span class="org-string">"DEVEL"</span>
        __pkgtools__base_msg $<span class="org-variable-name">@</span>
        pkgtools__msg_color_no_reverse
    <span class="org-keyword">fi</span>
    pkgtools__msg_color_normal
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5-8" class="outline-4">
<h4 id="sec-1-5-8">Be quiet</h4>
<div class="outline-text-4" id="text-1-5-8">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_using_quiet</span> ()
{
    pkgtools__msg_using_verbose
    <span class="org-variable-name">__pkgtools__msg_quiet</span>=1
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_not_using_quiet</span> ()
{
    <span class="org-variable-name">__pkgtools__msg_quiet</span>=0
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_is_quiet</span> ()
{
    <span class="org-builtin">local</span> <span class="org-variable-name">quiet_ret</span>=1 <span class="org-comment-delimiter"># </span><span class="org-comment">false</span>
    <span class="org-keyword">if</span> [ <span class="org-string">"x${PKGTOOLS_MSG_QUIET}"</span> != <span class="org-string">"x"</span> ]; <span class="org-keyword">then</span>
        <span class="org-keyword">if</span> [ <span class="org-string">"x${PKGTOOLS_MSG_QUIET}"</span> != <span class="org-string">"x0"</span> ]; <span class="org-keyword">then</span>
            <span class="org-variable-name">quiet_ret</span>=0 <span class="org-comment-delimiter"># </span><span class="org-comment">false</span>
        <span class="org-keyword">fi</span>
    <span class="org-keyword">else</span>
        <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_quiet</span>} -eq 1  ]; <span class="org-keyword">then</span>
            <span class="org-variable-name">quiet_ret</span>=0 <span class="org-comment-delimiter"># </span><span class="org-comment">true</span>
        <span class="org-keyword">fi</span>
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> ${<span class="org-variable-name">quiet_ret</span>}
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5-9" class="outline-4">
<h4 id="sec-1-5-9">Print date</h4>
<div class="outline-text-4" id="text-1-5-9">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_using_date</span> ()
{
    <span class="org-variable-name">__pkgtools__msg_use_date</span>=1
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_not_using_date</span> ()
{
    <span class="org-variable-name">__pkgtools__msg_use_date</span>=0
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5-10" class="outline-4">
<h4 id="sec-1-5-10">Make use of color</h4>
<div class="outline-text-4" id="text-1-5-10">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_using_color</span> ()
{
    <span class="org-variable-name">__pkgtools__msg_use_color</span>=1
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__msg_not_using_color</span> ()
{
    <span class="org-variable-name">__pkgtools__msg_use_color</span>=0
    pkgtools__msg_color_normal
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5-11" class="outline-4">
<h4 id="sec-1-5-11">Misc.</h4>
<div class="outline-text-4" id="text-1-5-11">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">__pkgtools__base_msg_prefix</span> ()
{
    <span class="org-builtin">local</span> <span class="org-variable-name">log_file</span>=
    <span class="org-keyword">if</span> [ <span class="org-string">"x${PKGTOOLS_LOG_FILE}"</span> != <span class="org-string">"x"</span> ]; <span class="org-keyword">then</span>
        <span class="org-variable-name">log_file</span>=${<span class="org-variable-name">PKGTOOLS_LOG_FILE</span>}
    <span class="org-keyword">else</span>
        <span class="org-variable-name">log_file</span>=/dev/null
    <span class="org-keyword">fi</span>
    <span class="org-builtin">local</span> <span class="org-variable-name">msg_prefix</span>=<span class="org-string">"$1"</span>
    (
        (
            <span class="org-builtin">echo</span> -n <span class="org-string">"${msg_prefix}: "</span>
        ) | tee -a ${<span class="org-variable-name">log_file</span>}
    ) 1&gt;&amp;2
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">__pkgtools__base_msg</span> ()
{
    <span class="org-builtin">local</span> <span class="org-variable-name">log_file</span>=
    <span class="org-keyword">if</span> [ <span class="org-string">"x${PKGTOOLS_LOG_FILE}"</span> != <span class="org-string">"x"</span> ]; <span class="org-keyword">then</span>
        <span class="org-variable-name">log_file</span>=${<span class="org-variable-name">PKGTOOLS_LOG_FILE</span>}
    <span class="org-keyword">else</span>
        <span class="org-variable-name">log_file</span>=/dev/null
    <span class="org-keyword">fi</span>
    (
        (
            <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_use_date</span>} -eq 1 ]; <span class="org-keyword">then</span>
                date +%F-%T | tr -d <span class="org-string">'\n'</span>
                <span class="org-builtin">echo</span> -n <span class="org-string">" @ "</span>
            <span class="org-keyword">fi</span>
            <span class="org-keyword">if</span> [ <span class="org-string">"x${appname}"</span> != <span class="org-string">"x"</span> ]; <span class="org-keyword">then</span>
                <span class="org-builtin">echo</span> -n <span class="org-string">"${appname}: "</span>
            <span class="org-keyword">fi</span>
            <span class="org-keyword">if</span> [ <span class="org-string">"x${__pkgtools__msg_funcname}"</span> != <span class="org-string">"x"</span> ]; <span class="org-keyword">then</span>
                <span class="org-builtin">echo</span> -n <span class="org-string">"${__pkgtools__msg_funcname}: "</span>
            <span class="org-keyword">fi</span>
            <span class="org-keyword">if</span> [ ${<span class="org-variable-name">__pkgtools__msg_split_lines</span>} -eq 1 ]; <span class="org-keyword">then</span>
                <span class="org-builtin">echo</span> <span class="org-string">""</span>
                <span class="org-builtin">echo</span> -n <span class="org-string">"  "</span>
            <span class="org-keyword">fi</span>
            <span class="org-builtin">echo</span> <span class="org-string">"$@"</span>
        ) | tee -a ${<span class="org-variable-name">log_file</span>}
    ) 1&gt;&amp;2
    <span class="org-keyword">return</span> 0;
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">Shell utilities</h3>
