zsh-utilities-pkgtools.org
*** Add path to environment variable
This function add a directory to an environment variable such as =PATH= or
=LD_LIBRARY_PATH=. It does it gently since it does not add the path if it is
already present. In such way, it prevents cumbersome of environment variables.

#+BEGIN_SRC sh
  function pkgtools__add_path_to_env_variable ()
  {
      if [ ! -d "$2" ]; then
          pkgtools__msg_error "Directory '$2' does not exist!"
          return 1
      fi
      local _path=${(P)$(echo $1)}
      # Export it if empty
      [[ ! -n ${_path} ]] && export $1
      case ":$_path:" in
          *":$2:"*) :;; # already there
          *) eval $(echo $1="$2${_path:+":$_path"}");;
      esac
      return 0
  }

  function pkgtools__add_path_to_PATH ()
  {
      pkgtools__add_path_to_env_variable PATH "$1"
      return 0
  }

  function pkgtools__add_path_to_LD_LIBRARY_PATH ()
  {
      pkgtools__add_path_to_env_variable LD_LIBRARY_PATH "$1"
      return 0
  }
#+END_SRC
*** Remove path to environment variable
The same as before: it keeps safe the environment variable by only removing the
relevant path.
#+BEGIN_SRC sh
  function pkgtools__remove_path_to_env_variable ()
  {
      local _path=${(P)$(echo $1)}
      eval $(echo $1=$(echo ${_path} | sed -e 's;\(^'$2':\|:'$2'$\|:'$2'\(:\)\)\|'$2';\2;g'))
      # Unset it if empty
      [[ ! -n ${(P)$(echo $1)} ]] && unset $1
      return 0
  }

  function pkgtools__remove_path_to_PATH ()
  {
      pkgtools__remove_path_to_env_variable PATH "$1"
      return 0
  }

  function pkgtools__remove_path_to_LD_LIBRARY_PATH ()
  {
      pkgtools__remove_path_to_env_variable LD_LIBRARY_PATH "$1"
      return 0
  }
#+END_SRC

*** Set variable if not already exported
#+BEGIN_SRC sh
  function pkgtools__set_variable ()
  {
      if $(pkgtools__check_variable $1); then
          pkgtools__msg_warning "$1 is already set and exported"
      else
          export $1=$2
      fi
      return 0
  }
#+END_SRC
*** Unset variable
#+BEGIN_SRC sh
  function pkgtools__unset_variable ()
  {
      unset $1
      return 0
  }
#+END_SRC
*** Reset variable
This is just a combination of the two previous functions to force the export a
variable.
#+BEGIN_SRC sh
  function pkgtools__reset_variable ()
  {
      pkgtools__unset_variable $1
      pkgtools__set_variable $1 $2
      return 0
  }
#+END_SRC
*** Check binary presence
#+BEGIN_SRC sh
  function pkgtools__has_binary ()
  {
      which $1 > /dev/null 2>&1
      return $?
  }
#+END_SRC
*** Check last command status
#+BEGIN_SRC sh
  function pkgtools__last_command_succeeds ()
  {
      if [ $? -ne 0 ]; then
          return 1
      else
          return 0
      fi
  }
  function pkgtools__last_command_fails ()
  {
      if [ $? -ne 0 ]; then
          return 0
      else
          return 1
      fi
  }
#+END_SRC
*** Get binary path
#+BEGIN_SRC sh
  function pkgtools__get_binary_path ()
  {
      local path="$(whereis $1 | cut -d' ' -f2)"
      if [ -z $path ]; then
          path="$(which $1)"
      fi
      echo $path
      return 0
  }
#+END_SRC
*** Check if laptop is @ LAL
#+BEGIN_SRC sh
  function pkgtools__at_LAL ()
  {
      ping -c 1 nemo4 > /dev/null 2>&1
      return $?
  }
#+END_SRC

*** Get system environment
#+BEGIN_SRC sh
  function pkgtools__get_os ()
  {
      echo "${__pkgtools__os}"
      return 0
  }

  function pkgtools__get_arch ()
  {
      echo "${__pkgtools__arch}"
      return 0
  }
  function pkgtools__get_sys ()
  {
      echo "$(pkgtools__get_os)-$(pkgtools__get_arch)"
      return 0
  }
#+END_SRC

*** Quielty run a command
#+BEGIN_SRC sh
  function pkgtools__quietly_run ()
  {
      if $(pkgtools__msg_is_quiet); then
          if eval "$@" > /dev/null 2>&1; then
              return 0
          else
              return 1
          fi
      else
          if eval "$@"; then
              return 0
          else
              return 1
          fi
      fi
  }
#+END_SRC
*** Yes/No question
#+BEGIN_SRC sh
  function pkgtools__yesno_question ()
  {
      PS3="$@ "
      yesno=("yes" "no")
      select ans in "${yesno[@]}"
      do
          case $ans in
              [Yy]*)
                  __pkgtools_answer_is_yes=true
                  break
                  ;;
              [Nn]*)
                  __pkgtools_answer_is_yes=false
                  break
                  ;;
          esac
      done
  }
  function pkgtools__answer_is_yes ()
  {
      if ${__pkgtools_answer_is_yes}; then
          return 0
      else
          return 1
      fi
  }
  function pkgtools__answer_is_no ()
  {
      if ${__pkgtools_answer_is_yes}; then
          return 1
      else
          return 0
      fi
  }
#+END_SRC
*** Enter directory and store PWD
#+BEGIN_SRC sh
  function pkgtools__enter_directory ()
  {
      local dir=$1
      if [[ -z $dir ]]; then
          pkgtools__msg_error "Empty directory !"
          return 1
      elif [[ ! -d $dir ]]; then
          pkgtools__msg_devel "Creating directory '${dir}'"
          mkdir -p $dir
      fi
      __pkgtools__stored_pwd="$PWD"
      cd $dir
      return 0
  }
#+END_SRC
*** Leave directory and get back to PWD
#+BEGIN_SRC sh
  function pkgtools__exit_directory ()
  {
      if [[ -z ${__pkgtools__stored_pwd} ]]; then
          pkgtools__msg_error "No stacked directory!"
          return 1
      fi
      cd ${__pkgtools__stored_pwd}
      return 0
  }
#+END_SRC
