zsh-utilities-pkgtools.html
<div class="outline-text-3" id="text-1-6">
</div><div id="outline-container-sec-1-6-1" class="outline-4">
<h4 id="sec-1-6-1">Add path to environment variable</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
This function add a directory to an environment variable such as <code>PATH</code> or
<code>LD_LIBRARY_PATH</code>. It does it gently since it does not add the path if it is
already present. In such way, it prevents cumbersome of environment variables.
</p>

<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__add_path_to_env_variable</span> ()
{
    <span class="org-keyword">if</span> [ <span class="org-negation-char">!</span> -d <span class="org-string">"$2"</span> ]; <span class="org-keyword">then</span>
        pkgtools__msg_error <span class="org-string">"Directory '$2' does not exist!"</span>
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">fi</span>
    <span class="org-builtin">local</span> <span class="org-variable-name">_path</span>=${(P)$(<span class="org-builtin">echo</span> $<span class="org-variable-name">1</span>)}
    <span class="org-comment-delimiter"># </span><span class="org-comment">Export it if empty</span>
    [[ <span class="org-negation-char">!</span> -n ${<span class="org-variable-name">_path</span>} ]] &amp;&amp; <span class="org-builtin">export</span> $<span class="org-variable-name">1</span>
    <span class="org-keyword">case</span> <span class="org-string">":$_path:"</span><span class="org-keyword"> in</span>
        *<span class="org-string">":$2:"</span>*) :;; <span class="org-comment-delimiter"># </span><span class="org-comment">already there</span>
        *) <span class="org-builtin">eval</span> $(<span class="org-builtin">echo</span> $<span class="org-variable-name">1</span>=<span class="org-string">"$2${_path:+"</span>:$<span class="org-variable-name">_path</span><span class="org-string">"}"</span>);;
    <span class="org-keyword">esac</span>
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__add_path_to_PATH</span> ()
{
    pkgtools__add_path_to_env_variable PATH <span class="org-string">"$1"</span>
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__add_path_to_LD_LIBRARY_PATH</span> ()
{
    pkgtools__add_path_to_env_variable LD_LIBRARY_PATH <span class="org-string">"$1"</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-2" class="outline-4">
<h4 id="sec-1-6-2">Remove path to environment variable</h4>
<div class="outline-text-4" id="text-1-6-2">
<p>
The same as before: it keeps safe the environment variable by only removing the
relevant path.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__remove_path_to_env_variable</span> ()
{
    <span class="org-builtin">local</span> <span class="org-variable-name">_path</span>=${(P)$(<span class="org-builtin">echo</span> $<span class="org-variable-name">1</span>)}
    <span class="org-builtin">eval</span> $(<span class="org-builtin">echo</span> $<span class="org-variable-name">1</span>=$(<span class="org-builtin">echo</span> ${<span class="org-variable-name">_path</span>} | sed -e <span class="org-string">'s;\(^'</span>$<span class="org-variable-name">2</span><span class="org-string">':\|:'</span>$<span class="org-variable-name">2</span><span class="org-string">'$\|:'</span>$<span class="org-variable-name">2</span><span class="org-string">'\(:\)\)\|'</span>$<span class="org-variable-name">2</span><span class="org-string">';\2;g'</span>))
    <span class="org-comment-delimiter"># </span><span class="org-comment">Unset it if empty</span>
    [[ <span class="org-negation-char">!</span> -n ${(P)$(<span class="org-builtin">echo</span> $<span class="org-variable-name">1</span>)} ]] &amp;&amp; <span class="org-builtin">unset</span> $<span class="org-variable-name">1</span>
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__remove_path_to_PATH</span> ()
{
    pkgtools__remove_path_to_env_variable PATH <span class="org-string">"$1"</span>
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__remove_path_to_LD_LIBRARY_PATH</span> ()
{
    pkgtools__remove_path_to_env_variable LD_LIBRARY_PATH <span class="org-string">"$1"</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-6-3" class="outline-4">
<h4 id="sec-1-6-3">Set variable if not already exported</h4>
<div class="outline-text-4" id="text-1-6-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__set_variable</span> ()
{
    <span class="org-keyword">if</span> env | grep -q <span class="org-string">"^$1="</span>
    <span class="org-keyword">then</span>
        pkgtools__msg_warning <span class="org-string">"$1 is already set and exported"</span>
    <span class="org-keyword">else</span>
        <span class="org-builtin">export</span> $<span class="org-variable-name">1</span>=$<span class="org-variable-name">2</span>
    <span class="org-keyword">fi</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-4" class="outline-4">
<h4 id="sec-1-6-4">Unset variable</h4>
<div class="outline-text-4" id="text-1-6-4">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__unset_variable</span> ()
{
    <span class="org-builtin">unset</span> $<span class="org-variable-name">1</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-5" class="outline-4">
<h4 id="sec-1-6-5">Reset variable</h4>
<div class="outline-text-4" id="text-1-6-5">
<p>
This is just a combination of the two previous functions to force the export a
variable.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__reset_variable</span> ()
{
    pkgtools__unset_variable $<span class="org-variable-name">1</span>
    pkgtools__set_variable $<span class="org-variable-name">1</span> $<span class="org-variable-name">2</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-6" class="outline-4">
<h4 id="sec-1-6-6">Check binary presence</h4>
<div class="outline-text-4" id="text-1-6-6">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__has_binary</span> ()
{
    <span class="org-builtin">which</span> $<span class="org-variable-name">1</span> &gt; /dev/null 2&gt;&amp;1
    <span class="org-keyword">return</span> $<span class="org-variable-name">?</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-7" class="outline-4">
<h4 id="sec-1-6-7">Check last command status</h4>
<div class="outline-text-4" id="text-1-6-7">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__last_command_succeeds</span> ()
{
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">?</span> -ne 0 ]; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">else</span>
        <span class="org-keyword">return</span> 0
    <span class="org-keyword">fi</span>
}
<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__last_command_fails</span> ()
{
    <span class="org-keyword">if</span> [ $<span class="org-variable-name">?</span> -ne 0 ]; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span> 0
    <span class="org-keyword">else</span>
        <span class="org-keyword">return</span> 1
    <span class="org-keyword">fi</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-8" class="outline-4">
<h4 id="sec-1-6-8">Get binary path</h4>
<div class="outline-text-4" id="text-1-6-8">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__get_binary_path</span> ()
{
    <span class="org-builtin">echo</span> $(whereis $<span class="org-variable-name">1</span> | cut -d<span class="org-string">' '</span> -f2)
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-9" class="outline-4">
<h4 id="sec-1-6-9">Check if laptop is @ LAL</h4>
<div class="outline-text-4" id="text-1-6-9">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__at_LAL</span> ()
{
    ping -c 1 pc-nemo9 &gt; /dev/null 2&gt;&amp;1
    <span class="org-keyword">return</span> $<span class="org-variable-name">?</span>
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-6-10" class="outline-4">
<h4 id="sec-1-6-10">Get system environment</h4>
<div class="outline-text-4" id="text-1-6-10">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">pkgtools__get_os</span> ()
{
    <span class="org-builtin">echo</span> <span class="org-string">"${__pkgtools__os}"</span>
    <span class="org-keyword">return</span> 0
}

<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__get_arch</span> ()
{
    <span class="org-builtin">echo</span> <span class="org-string">"${__pkgtools__arch}"</span>
    <span class="org-keyword">return</span> 0
}
<span class="org-keyword">function</span> <span class="org-function-name">pkgtools__get_sys</span> ()
{
    <span class="org-builtin">echo</span> <span class="org-string">"$(pkgtools__get_os)-$(pkgtools__get_arch)"</span>
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
File under git version control - commit e8b7f82 - 2013-10-30
</div>
</body>
</html>
